<img src="https://user-images.githubusercontent.com/7065401/75165824-badf4680-5701-11ea-9c5b-5475b0a33abf.png"
    style="width:300px; float: right; margin: 0 40px 40px 40px;"></img>

# Pandas - Series


Pandas is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

Agenda

- What is Data Frames?
- What is Data Series?
- Different operation in Pandas



## Pandas Series

We'll start analyzing "[The Group of Seven](https://en.wikipedia.org/wiki/Group_of_Seven)". Which is a political formed by Canada, France, Germany, Italy, Japan, the United Kingdom and the United States. We'll start by analyzing population, and for that, we'll use a `pandas.Series` object.

In [1]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [2]:
# In millions
pop = pd.Series([35.467, 63.951, 80.940, 60.665, 127.061, 64.511, 318.523])

In [3]:
pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

In [4]:
pop.dtype

dtype('float64')

In [7]:
pop.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
dtype: float64

In [8]:
pd.Series({
    'Canada': 35.467,
    'France': 63.951,
    'Germany': 80.94,
    'Italy': 60.665,
    'Japan': 127.061,
    'United Kingdom': 64.511,
    'United States': 318.523
}, name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [9]:
pd.Series(
    [35.467, 63.951, 80.94, 60.665, 127.061, 64.511, 318.523],
    index=['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
    name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [10]:
pop * 20

Canada             709.34
France            1279.02
Germany           1618.80
Italy             1213.30
Japan             2541.22
United Kingdom    1290.22
United States     6370.46
dtype: float64

In [11]:
pop.mean()

107.30257142857144

In [12]:
pop['France': 'Italy'].mean()

68.51866666666666

In [13]:
pop[pop < 70]

Canada            35.467
France            63.951
Italy             60.665
United Kingdom    64.511
dtype: float64

In [15]:
pop[pop < 70] = 99.99
pop

Canada             99.990
France             99.990
Germany            80.940
Italy              99.990
Japan             127.061
United Kingdom     99.990
United States     318.523
dtype: float64

## Pandas Dataframe

We'll keep our analysis of G7 countries and looking now at DataFrames. As said, a DataFrame looks a lot like a table (as the one you can appreciate [here](https://docs.google.com/spreadsheets/d/1IlorV2-Oh9Da1JAZ7weVw86PQrQydSMp-ydVMH135iI/edit?usp=sharing)):

<img width="700" src="https://user-images.githubusercontent.com/872296/38153492-72c032ca-3443-11e8-80f4-9de9060a5127.png" />

Creating `DataFrame`s manually can be tedious. 99% of the time you'll be pulling the data from a Database, a csv file or the web. But still, you can create a DataFrame by specifying the columns and values:

In [73]:
df = pd.DataFrame({
    'Population': [35.467, 63.951, 80.94 , 60.665, 127.061, 64.511, 318.523],
    'GDP': [
        1785387,
        2833687,
        3874437,
        2167744,
        4602367,
        2950039,
        17348075
    ],
    'Surface Area': [
        9984670,
        640679,
        357114,
        301336,
        377930,
        242495,
        9525067
    ],
    'HDI': [
        0.913,
        0.888,
        0.916,
        0.873,
        0.891,
        0.907,
        0.915
    ],
    'Continent': [
        'America',
        'Europe',
        'Europe',
        'Europe',
        'Asia',
        'Europe',
        'America'
    ]
})



df.head()

   Population      GDP  Surface Area    HDI Continent
0      35.467  1785387       9984670  0.913   America
1      63.951  2833687        640679  0.888    Europe
2      80.940  3874437        357114  0.916    Europe
3      60.665  2167744        301336  0.873    Europe
4     127.061  4602367        377930  0.891      Asia

In [74]:
df.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

df.head()

         Population      GDP  Surface Area    HDI Continent
Canada       35.467  1785387       9984670  0.913   America
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe
Japan       127.061  4602367        377930  0.891      Asia

In [75]:
print(df.columns)
print("")
print(df.index)

Index(['Population', 'GDP', 'Surface Area', 'HDI', 'Continent'], dtype='object')

Index(['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
      dtype='object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Canada to United States
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Population    7 non-null      float64
 1   GDP           7 non-null      int64
 2   Surface Area  7 non-null      int64
 3   HDI           7 non-null      float64
 4   Continent     7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 336.0+ bytes

In [77]:
df.shape

(7, 5)

In [78]:
df.describe()

       Population           GDP  Surface Area       HDI
count    7.000000  7.000000e+00  7.000000e+00  7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429
std     97.249970  5.494020e+06  4.576187e+06  0.016592
min     35.467000  1.785387e+06  2.424950e+05  0.873000
25%     62.308000  2.500716e+06  3.292250e+05  0.889500
50%     64.511000  2.950039e+06  3.779300e+05  0.907000
75%    104.000500  4.238402e+06  5.082873e+06  0.914000
max    318.523000  1.734808e+07  9.984670e+06  0.916000

In [79]:
print(df.dtypes)
print("")
print(df.dtypes.value_counts())

Population      float64
GDP               int64
Surface Area      int64
HDI             float64
Continent        object
dtype: object

int64      2
float64    2
object     1
dtype: int64

## slicing & Indexing

In [80]:
df.loc['Canada']

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [81]:
df.iloc[-1]

Population       318.523
GDP             17348075
Surface Area     9525067
HDI                0.915
Continent        America
Name: United States, dtype: object

In [82]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [83]:
df['Population']

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: Population, dtype: float64

Note that the `index` of the returned Series is the same as the DataFrame one. And its `name` is the name of the column. If you're working on a notebook and want to see a more DataFrame-like format you can use the `to_frame` method:

In [84]:
df['Population'].to_frame()

                Population
Canada              35.467
France              63.951
Germany             80.940
Italy               60.665
Japan              127.061
United Kingdom      64.511
United States      318.523

In [85]:
df[['Population', 'GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [86]:
df.loc['France': 'Italy']

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe
Italy        60.665  2167744        301336  0.873    Europe

In [87]:
df[1:3]

         Population      GDP  Surface Area    HDI Continent
France       63.951  2833687        640679  0.888    Europe
Germany      80.940  3874437        357114  0.916    Europe

Row level selection works better with `loc` and `iloc` **which are recommended** over regular "direct slicing" (`df[:]`).

 - `loc` selects rows matching the given index:


 - `iloc` works with the (numeric) "position" of the index:

In [88]:
df.iloc[0]

Population       35.467
GDP             1785387
Surface Area    9984670
HDI               0.913
Continent       America
Name: Canada, dtype: object

In [89]:
df.iloc[[0, 1, -1]]

               Population       GDP  Surface Area    HDI Continent
Canada             35.467   1785387       9984670  0.913   America
France             63.951   2833687        640679  0.888    Europe
United States     318.523  17348075       9525067  0.915   America

In [90]:
df.iloc[1:3, 3]

France     0.888
Germany    0.916
Name: HDI, dtype: float64

In [91]:
df.iloc[1:3, 1:3]

             GDP  Surface Area
France   2833687        640679
Germany  3874437        357114

In [92]:
# Conditional selection

df.loc[df['Population'] > 70]

               Population       GDP  Surface Area    HDI Continent
Germany            80.940   3874437        357114  0.916    Europe
Japan             127.061   4602367        377930  0.891      Asia
United States     318.523  17348075       9525067  0.915   America

In [93]:
# Dropping stuff

df.drop('Canada')

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [94]:
df.drop(columns=['Population', 'HDI'])

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [95]:
df.drop(['Population', 'HDI'], axis=1)

                     GDP  Surface Area Continent
Canada           1785387       9984670   America
France           2833687        640679    Europe
Germany          3874437        357114    Europe
Italy            2167744        301336    Europe
Japan            4602367        377930      Asia
United Kingdom   2950039        242495    Europe
United States   17348075       9525067   America

In [96]:
df.drop(['Canada', 'Germany'], axis='rows')

                Population       GDP  Surface Area    HDI Continent
France              63.951   2833687        640679  0.888    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [97]:
# operations

df[['Population', 'GDP']] / 100

                Population        GDP
Canada             0.35467   17853.87
France             0.63951   28336.87
Germany            0.80940   38744.37
Italy              0.60665   21677.44
Japan              1.27061   46023.67
United Kingdom     0.64511   29500.39
United States      3.18523  173480.75

## Modifying DataFrames

It's simple and intuitive, You can add columns, or replace values for columns without issues:

In [98]:
df

                Population       GDP  Surface Area    HDI Continent
Canada              35.467   1785387       9984670  0.913   America
France              63.951   2833687        640679  0.888    Europe
Germany             80.940   3874437        357114  0.916    Europe
Italy               60.665   2167744        301336  0.873    Europe
Japan              127.061   4602367        377930  0.891      Asia
United Kingdom      64.511   2950039        242495  0.907    Europe
United States      318.523  17348075       9525067  0.915   America

In [99]:
df['Language'] = 'English'

In [100]:
df

                Population       GDP  Surface Area    HDI Continent Language
Canada              35.467   1785387       9984670  0.913   America  English
France              63.951   2833687        640679  0.888    Europe  English
Germany             80.940   3874437        357114  0.916    Europe  English
Italy               60.665   2167744        301336  0.873    Europe  English
Japan              127.061   4602367        377930  0.891      Asia  English
United Kingdom      64.511   2950039        242495  0.907    Europe  English
United States      318.523  17348075       9525067  0.915   America  English

In [101]:
# renaming columns

df.rename(
    columns={
        'HDI': 'Human Development Index',
        'Anual Popcorn Consumption': 'APC'
    }, index={
        'United States': 'USA',
        'United Kingdom': 'UK',
        'Argentina': 'AR'
    })

         Population       GDP  ...  Continent  Language
Canada       35.467   1785387  ...    America   English
France       63.951   2833687  ...     Europe   English
Germany      80.940   3874437  ...     Europe   English
Italy        60.665   2167744  ...     Europe   English
Japan       127.061   4602367  ...       Asia   English
UK           64.511   2950039  ...     Europe   English
USA         318.523  17348075  ...    America   English

[7 rows x 6 columns]

In [103]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [104]:
us_weather = pd.DataFrame({"city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [105]:
weather_df = pd.concat([india_weather, us_weather])
weather_df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [106]:
weather_df = pd.concat([india_weather, us_weather], keys=["india", "us"])
weather_df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [107]:
weather_df.loc["india"]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

## Creating columns from other columns

Altering a DataFrame often involves combining different columns into another. For example, in our Countries analysis, we could try to calculate the "GDP per capita", which is just, `GDP / Population`.

In [126]:
df

                Population       GDP  ...          data  GDP Per Capita
Canada              35.467   1785387  ...  50339.385908    50339.385908
France              63.951   2833687  ...  44310.284437    44310.284437
Germany             80.940   3874437  ...  47868.013343    47868.013343
Italy               60.665   2167744  ...  35733.025633    35733.025633
Japan              127.061   4602367  ...  36221.712406    36221.712406
United Kingdom      64.511   2950039  ...  45729.239975    45729.239975
United States      318.523  17348075  ...  54464.120330    54464.120330

[7 rows x 8 columns]

In [127]:
df[['Population', 'GDP']]

                Population       GDP
Canada              35.467   1785387
France              63.951   2833687
Germany             80.940   3874437
Italy               60.665   2167744
Japan              127.061   4602367
United Kingdom      64.511   2950039
United States      318.523  17348075

In [133]:
df['GDP Per Capita'] = df['GDP'] / df['Population']
df.head()

         Population      GDP  Surface Area  ...  Continent Language GDP Per Capita
Canada       35.467  1785387       9984670  ...    America  English   50339.385908
France       63.951  2833687        640679  ...     Europe  English   44310.284437
Germany      80.940  3874437        357114  ...     Europe  English   47868.013343
Italy        60.665  2167744        301336  ...     Europe  English   35733.025633
Japan       127.061  4602367        377930  ...       Asia  English   36221.712406

[5 rows x 7 columns]

## Statistical info

You've already seen the `describe` method, which gives you a good "summary" of the `DataFrame`. Let's explore other methods in more detail:

In [134]:
df.head()

         Population      GDP  Surface Area  ...  Continent Language GDP Per Capita
Canada       35.467  1785387       9984670  ...    America  English   50339.385908
France       63.951  2833687        640679  ...     Europe  English   44310.284437
Germany      80.940  3874437        357114  ...     Europe  English   47868.013343
Italy        60.665  2167744        301336  ...     Europe  English   35733.025633
Japan       127.061  4602367        377930  ...       Asia  English   36221.712406

[5 rows x 7 columns]

In [135]:
df.describe()

       Population           GDP  Surface Area       HDI  GDP Per Capita
count    7.000000  7.000000e+00  7.000000e+00  7.000000        7.000000
mean   107.302571  5.080248e+06  3.061327e+06  0.900429    44952.254576
std     97.249970  5.494020e+06  4.576187e+06  0.016592     6954.983875
min     35.467000  1.785387e+06  2.424950e+05  0.873000    35733.025633
25%     62.308000  2.500716e+06  3.292250e+05  0.889500    40265.998421
50%     64.511000  2.950039e+06  3.779300e+05  0.907000    45729.239975
75%    104.000500  4.238402e+06  5.082873e+06  0.914000    49103.699626
max    318.523000  1.734808e+07  9.984670e+06  0.916000    54464.120330

In [136]:
print(df['Population'].min())
print(df['Population'].max())

35.467
318.523

In [137]:
df['Population'].sum() / len(df['Population'])

107.30257142857144

In [138]:
df['Population'].mean()

107.30257142857144

In [139]:
df['Population'].median()

64.511

## URL to CSV

https://download.bls.gov/pub/time.series/cu/cu.item

In [140]:
## URL to CSV

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')

In [141]:
df.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           400
2       SA0  ...             1
3      SA0E  ...           375
4     SA0L1  ...           359

[5 rows x 5 columns]

##  Json to CSV

In [142]:
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'

dfj = pd.read_json(Data)
dfj

  employee_name  ...                                        job_profile
0         James  ...  {'title1': 'Team Lead', 'title2': 'Sr. Develop...

[1 rows x 3 columns]

In [143]:
dfjson = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data')

https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data

In [149]:
dfjson.head()

   1  14.23  1.71  2.43  15.6  127  ...   .28  2.29  5.64  1.04  3.92  1065
0  1  13.20  1.78  2.14  11.2  100  ...  0.26  1.28  4.38  1.05  3.40  1050
1  1  13.16  2.36  2.67  18.6  101  ...  0.30  2.81  5.68  1.03  3.17  1185
2  1  14.37  1.95  2.50  16.8  113  ...  0.24  2.18  7.80  0.86  3.45  1480
3  1  13.24  2.59  2.87  21.0  118  ...  0.39  1.82  4.32  1.04  2.93   735
4  1  14.20  1.76  2.45  15.2  112  ...  0.34  1.97  6.75  1.05  2.85  1450

[5 rows x 14 columns]

In [145]:
# convert Json to csv

dfjson.to_csv('wine.csv')

In [146]:

dfjson.to_json("winejson.json")

## Reading HTML content 

Basically reading a table 


https://www.fdic.gov/bank/individual/failed/banklist.html

In [157]:
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df_html = pd.read_html(url)

In [159]:
df_html[0].head()

                      Bank NameBank  ... FundFund
0                 Almena State Bank  ...    10538
1        First City Bank of Florida  ...    10537
2              The First State Bank  ...    10536
3                Ericson State Bank  ...    10535
4  City National Bank of New Jersey  ...    10534

[5 rows x 7 columns]

https://en.wikipedia.org/wiki/Mobile_country_code

In [151]:
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc, match='Country')

In [154]:
dfs[0].head()

   Mobile country code  ...                   Remarks
0                  289  ...  MCC is not listed by ITU
1                  412  ...                       NaN
2                  276  ...                       NaN
3                  603  ...                       NaN
4                  544  ...                       NaN

[5 rows x 6 columns]

## Reading EXcel Files

In [165]:
df_excel = pd.read_excel("https://jyoti.co.in/wp-content/uploads/2015/03/sample.xlsx")

In [166]:
df_excel.head()

   Unnamed: 0  Unnamed: 1  ...                             Unnamed: 3 Unnamed: 4
0         NaN         NaN  ...                                    NaN        NaN
1         NaN         NaN  ...     Excel 2007 (xlsx) Sample Worksheet        NaN
2         NaN         NaN  ...  Created with Microsoft Excel 2007 SP1        NaN
3         NaN         NaN  ...                                    NaN        NaN
4         NaN         NaN  ...                                      X          Y

[5 rows x 5 columns]

## Pickling
All pandas objects are equipped with to_pickle methods which use Pythons cPickle module to save data structures to disk using the pickle format.

In [167]:
df_excel.to_pickle('df_excel_pickle')

In [170]:
df_pickle = pd.read_pickle('df_excel_pickle')

In [171]:
df_pickle.head()

   Unnamed: 0  Unnamed: 1  ...                             Unnamed: 3 Unnamed: 4
0         NaN         NaN  ...                                    NaN        NaN
1         NaN         NaN  ...     Excel 2007 (xlsx) Sample Worksheet        NaN
2         NaN         NaN  ...  Created with Microsoft Excel 2007 SP1        NaN
3         NaN         NaN  ...                                    NaN        NaN
4         NaN         NaN  ...                                      X          Y

[5 rows x 5 columns]